def sum_of_list(lst):
    return sum(lst)

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = sum_of_list(my_list)
print(result)  # Выведет: 55

# В этом примере мы передаем список [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] в функцию sum_of_list,
# которая использует функцию sum для вычисления суммы элементов списка.
# Результатом будет result = 55, что является суммой элементов списка.

# % Базовый случай: сумма элементов пустого списка равна нулю
# sum_list([], 0).
#
# % Рекурсивный случай: сумма элементов списка равна сумме головы списка и сумме остатка списка
# sum_list([Head|Tail], Sum) :-
#     sum_list(Tail, TailSum),  % вычисляем сумму остатка списка
#     Sum is Head + TailSum.    % вычисляем сумму элементов списка
#
# % Пример использования:
# ?- sum_list([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], Sum).
# Sum = 55.